tot::тот! {
    сыртқы жәшік tot;

    пайдалану std::collections::ХэшМап ретінде Сөзд;

    қасиет КілттікМән {
        фн жазу(&өзім, кілт: Жол, құндылық: Жол);
        фн алу(&өзім, кілт: Жол) -> Нәтиже<Опция<&Жол>, Жол>;
    }

    статик өзг СӨЗДІК: Опция<Сөзд<Жол, Жол>> = Жоқ;

    құрыл Concrète;

    асыру КілттікМән үшін Concrète {
        фн жазу(&өзім, кілт: Жол, құндылық: Жол) {
            беру сөзд = қауіпсіземес {
                СӨЗДІК.алу_немесе_енгізу(Әдепкі::әдепкі)
            };
            сөзд.кірістіру(кілт, құндылық);
        }
        фн алу(&өзім, кілт: Жол) -> Нәтиже<Опция<&Жол>, Жол> {
            егер беру Кейбір(сөзд) = қауіпсіземес { СӨЗДІК.сіл_ретінде() } {
                Жарайды(сөзд.алу(&кілт))
            } басқа {
                Қт("сөздікті алып келу".ішіне())
            }
        }
    }

    қоғы(жәшік) фн мүмкін(i: u32) -> Опция<Нәтиже<u32, Жол>> {
        егер i % 2 == 1 {
            егер i == 42 {
                Кейбір(Қт(Жол::дан("ойбай")))
            } басқа {
                Кейбір(Жарайды(33))
            }
        } басқа {
            Жоқ
        }
    }

    асинх фн мысал() {
    }

    асинх фн мысал2() {
        мысал().күту;
    }

    фн негізгі() {
        беру өзг x = 31;

        сәйкестік x {
            42 => {
                басыпшж!("бес саусақ")
            }
            _ => басыпшж!("алға")
        }

        үшін i ішінде 0..10 {
            беру val = цикл {
                үзіліс i;
            };

            ал сол x < val {
                x += 1;
            }

            x = егер беру Кейбір(нәтиже) = мүмкін(i) {
                нәтиже.ашу()
            } басқа {
                12
            };
        }

       // екіншіреттік();
    }

    #[рұқсатберу(code_inaccessible)]
    фн екіншіреттік() {
        ойбай!("ойбай"); // for the true Kazakh experience
        дүрбелең!("дүрбелең"); // for boring software devs
    }
}
